Ran Plan for dir: `terraform` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/desafio-acs/eks-terraform/12/default/terraform/terraform-root-default.tfplan\"" in "/home/atlantis/.atlantis/repos/desafio-acs/eks-terraform/12/default/terraform": exit status 1
module.eks_admin_users.aws_iam_user.eks_admin["desafio_aquarela_samuel"]: Refreshing state... [id=desafio_aquarela_samuel]
module.acm_wildcard.aws_acm_certificate.wildcard: Refreshing state... [id=arn:aws:acm:us-east-2:833565098889:certificate/02ef0c72-00b0-44b6-b075-e1a61423ad87]
module.eks_network.aws_eip.eks_ngw_eip_1b: Refreshing state... [id=eipalloc-04d8917391557c30d]
module.eks_network.data.aws_region.current: Reading...
module.eks_cluster.aws_iam_role.eks_cluster_role: Refreshing state... [id=desafio-aquarela-cluster-role]
module.eks_aws_load_balancer_controller.data.aws_region.current: Reading...
module.eks_network.aws_eip.eks_ngw_eip_1a: Refreshing state... [id=eipalloc-0159dc3bcb63f782b]
module.eks_aws_load_balancer_controller.data.aws_caller_identity.current: Reading...
module.eks_network.aws_vpc.eks_vpc: Refreshing state... [id=vpc-08b436880e0823f6f]
module.eks_managed_node_group.aws_iam_role.eks_mng_role: Refreshing state... [id=desafio-aquarela-mng-role]
module.eks_aws_load_balancer_controller.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.eks_aws_load_balancer_controller.aws_iam_policy.eks_controller_policy: Refreshing state... [id=arn:aws:iam::833565098889:policy/desafio-aquarela-aws-load-balancer-controller]
module.eks_aws_load_balancer_controller.data.aws_caller_identity.current: Read complete after 0s [id=833565098889]
module.eks_network.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.eks_admin_users.aws_iam_user_policy.eks_user_control_plane_access["desafio_aquarela_samuel"]: Refreshing state... [id=desafio_aquarela_samuel:desafio_aquarela_samuel-eks-read-admin-access-samuel]
module.eks_admin_users.aws_iam_access_key.eks_admin_key["desafio_aquarela_samuel"]: Refreshing state... [id=AKIA4EFC2AOEUKZRCSM6]
module.eks_cluster.aws_iam_role_policy_attachment.eks_cluster_role_attachment: Refreshing state... [id=desafio-aquarela-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks_managed_node_group.aws_iam_role_policy_attachment.eks_mng_role_attachment_ecr: Refreshing state... [id=desafio-aquarela-mng-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks_managed_node_group.aws_iam_role_policy_attachment.eks_mng_role_attachment_cni: Refreshing state... [id=desafio-aquarela-mng-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks_managed_node_group.aws_iam_role_policy_attachment.eks_mng_role_attachment_worker: Refreshing state... [id=desafio-aquarela-mng-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks_network.aws_subnet.eks_subnet_private_1b: Refreshing state... [id=subnet-0db279ed97c8e376c]
module.eks_network.aws_subnet.eks_subnet_public_1b: Refreshing state... [id=subnet-084d6e95c89a9801a]
module.eks_network.aws_internet_gateway.eks_igw: Refreshing state... [id=igw-023658afcc83879dd]
module.eks_network.aws_subnet.eks_subnet_private_1a: Refreshing state... [id=subnet-02a5e3f2afa9cbb5f]
module.eks_network.aws_subnet.eks_subnet_public_1a: Refreshing state... [id=subnet-0dad75bb00fcf1dac]
module.eks_network.aws_nat_gateway.eks_ngw_1b: Refreshing state... [id=nat-0ad9195a7b60c678c]
module.eks_network.aws_route_table.eks_public_route_table: Refreshing state... [id=rtb-0f5acbe36a7bbb74c]
module.eks_network.aws_nat_gateway.eks_ngw_1a: Refreshing state... [id=nat-0d33e0aa2fd745ad7]
module.eks_cluster.aws_eks_cluster.eks_cluster: Refreshing state... [id=desafio-aquarela-cluster]
module.eks_network.aws_route_table.eks_private_route_table_1b: Refreshing state... [id=rtb-00b16f8759c1f9935]
module.eks_network.aws_route_table.eks_private_route_table_1a: Refreshing state... [id=rtb-037d9efba7ec434a4]
module.eks_network.aws_route_table_association.eks_rtb_assoc_1a: Refreshing state... [id=rtbassoc-0304fb4c16dde2b7e]
module.eks_network.aws_route_table_association.eks_rtb_assoc_1b: Refreshing state... [id=rtbassoc-051caa542a7346354]
module.eks_network.aws_route_table_association.eks_rtb_assoc_priv_1b: Refreshing state... [id=rtbassoc-0048a12ea6407d425]
module.eks_network.aws_route_table_association.eks_rtb_assoc_priv_1a: Refreshing state... [id=rtbassoc-0200fe6a25c870d79]
module.eks_cluster.aws_security_group_rule.eks_cluster_sg_rule: Refreshing state... [id=sgrule-572044352]
module.eks_cluster.data.tls_certificate.eks_oidc_tls_certificate: Reading...
module.eks_admin_users.data.aws_eks_cluster.cluster: Reading...
module.eks_admin_users.data.aws_eks_cluster_auth.cluster: Reading...
module.eks_aws_load_balancer_controller.aws_iam_role.eks_controller_role: Refreshing state... [id=desafio-aquarela-aws-load-balancer-controller]
module.eks_admin_users.data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=desafio-aquarela-cluster]
module.eks_managed_node_group.aws_eks_node_group.eks_managed_node_group: Refreshing state... [id=desafio-aquarela-cluster:desafio-aquarela-nodegroup]
module.eks_cluster.data.tls_certificate.eks_oidc_tls_certificate: Read complete after 0s [id=0a759b1370f2328d0bd5dd3ac81215f4c3398ef8]
module.eks_cluster.aws_iam_openid_connect_provider.eks_oidc: Refreshing state... [id=arn:aws:iam::833565098889:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/E2DFAE04C3ED74049A29FB3AFA417C96]
module.eks_admin_users.data.aws_eks_cluster.cluster: Read complete after 0s [id=desafio-aquarela-cluster]
data.aws_eks_cluster_auth.cluster: Reading...
module.eks_aws_load_balancer_controller.aws_iam_role_policy_attachment.eks_controller_role_attachment: Refreshing state... [id=desafio-aquarela-aws-load-balancer-controller/arn:aws:iam::833565098889:policy/desafio-aquarela-aws-load-balancer-controller]
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=desafio-aquarela-cluster]
module.eks_aws_load_balancer_controller.helm_release.eks_helm_controller: Refreshing state... [id=aws-load-balancer-controller]
module.eks_admin_users.data.kubernetes_config_map.aws_auth: Reading...
helm_release.argocd: Refreshing state... [id=argocd]
kubernetes_namespace.argocd: Refreshing state... [id=argocd]
module.eks_aws_load_balancer_controller.kubernetes_service_account.eks_controller_sa: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.eks_admin_users.data.kubernetes_config_map.aws_auth: Read complete after 0s [id=kube-system/aws-auth]
module.eks_admin_users.kubernetes_config_map_v1_data.aws_auth_update: Refreshing state... [id=kube-system/aws-auth]
kubectl_manifest.app_of_apps_infra: Refreshing state... [id=/apis/argoproj.io/v1alpha1/namespaces/argocd/applicationsets/app-of-apps-infra]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_admin_users.kubernetes_config_map_v1_data.aws_auth_update has changed
  ~ resource "kubernetes_config_map_v1_data" "aws_auth_update" {
      ~ data          = {
          ~ "mapUsers" = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
              - - "groups":
              -   - "system:masters"
              -   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              -   "username": "desafio_aquarela_samuel"
              - - "groups":
              -   - "system:masters"
              -   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              -   "username": "desafio_aquarela_samuel"
              - - "groups":
              -   - "system:masters"
              -   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              -   "username": "desafio_aquarela_samuel"
              - - "groups":
              -   - "system:masters"
              -   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              -   "username": "desafio_aquarela_samuel"
              - - "groups":
              -   - "system:masters"
              -   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              -   "username": "desafio_aquarela_samuel"
              - - "groups":
              -   - "system:masters"
              -   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              -   "username": "desafio_aquarela_samuel"
              - - "groups":
              -   - "system:masters"
              -   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              -   "username": "desafio_aquarela_samuel"
              - - "groups":
              -   - "system:masters"
              -   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              -   "username": "desafio_aquarela_samuel"
            EOT
        }
        id            = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.0.11" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1758825015 -> (known after apply)
          ~ last_deployed  = 1758825015 -> (known after apply)
          ~ name           = "argocd" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n argocd 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file `server.ingress.enabled` and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - applicationSet = {
                      - enabled = true
                      - ingress = {
                          - enabled  = true
                          - hostname = "applicationset.thesams.site"
                          - path     = "/"
                        }
                      - metrics = {
                          - enabled = true
                        }
                    }
                  - configs        = {
                      - cm           = {
                          - "dex.config" = <<-EOT
                                connectors:
                                - type: github
                                  id: github
                                  name: GitHub
                                  config:
                                    clientID: Ov23lizYwGumahePRnUi
                                    clientSecret: 813fb618f0a616277af24577ac540a37e9ab0706
                                    orgs:
                                    - name: theSamsCo
                            EOT
                          - url          = "http://argocd.thesams.site"
                        }
                      - params       = {
                          - "dexserver.disable.tls"        = true
                          - "server.dex.server"            = "http://argocd-dex-server:5556"
                          - "server.dex.server.strict.tls" = false
                          - "server.insecure"              = true
                        }
                      - repositories = {
                          - infra-repo = {
                              - name     = "infra"
                              - password = "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"
                              - url      = "https://github.com/samuelamaralls/descomplicando-gitops-no-kubernetes-argocd.git"
                              - username = "token"
                            }
                        }
                    }
                  - controller     = {
                      - metrics = {
                          - enabled        = true
                          - rules          = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - namespace        = "monitoring"
                              - spec             = [
                                  - {
                                      - alert       = "ArgoAppMissing"
                                      - annotations = {
                                          - description = <<-EOT
                                                Argo CD has not reported any applications data for the past 15 minutes which means that it must be down or not functioning properly.  This needs to be resolved for this cloud to continue to maintain state.
                                            EOT
                                          - summary     = "[Argo CD] No reported applications"
                                        }
                                      - expr        = <<-EOT
                                            absent(argocd_app_info) == 1
                                        EOT
                                      - for         = "15m"
                                      - labels      = {
                                          - severity = "critical"
                                        }
                                    },
                                  - {
                                      - alert       = "ArgoAppNotSynced"
                                      - annotations = {
                                          - description = <<-EOT
                                                The application [{{`{{$labels.name}}`}} has not been synchronized for over 12 hours which means that the state of this cloud has drifted away from the state inside Git.
                                            EOT
                                          - summary     = "[{{`{{$labels.name}}`}}] Application not synchronized"
                                        }
                                      - expr        = <<-EOT
                                            argocd_app_info{sync_status!="Synced"} == 1
                                        EOT
                                      - for         = "12h"
                                      - labels      = {
                                          - severity = "warning"
                                        }
                                    },
                                ]
                            }
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - namespace        = "monitoring"
                            }
                        }
                    }
                  - dex            = {
                      - enabled = true
                    }
                  - nameOverride   = "argocd"
                  - repoServer     = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "prometheus"
                                }
                              - enabled          = true
                              - namespace        = "monitoring"
                            }
                        }
                    }
                  - server         = {
                      - metrics = {
                          - enabled        = false
                          - serviceMonitor = {
                              - additionalLabels = {
                                  - release = "monitoring"
                                }
                              - enabled          = false
                              - namespace        = "monitoring"
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "8.2.0" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      ~ values                     = [
          ~ <<-EOT
                nameOverride: argocd
                
                server:
                  #ingress:
                  #  enabled: true
                  #  ingressClassName: nginx
                  #  hostname: argocd.thesams.site
                  #  path: /
                  #  pathType: Prefix
                  #  annotations:
                  #    cert-manager.io/cluster-issuer: letsencrypt-prod
                  #    nginx.ingress.kubernetes.io/ssl-passthrough: "true"
                  #    nginx.ingress.kubernetes.io/backend-protocol: "HTTPS"
                  #  tls:
                  #    - hosts:
                  #        - argocd.thesams.site
                  #      secretName: argocd-server-tls
                  metrics:
                    enabled: false
                    serviceMonitor:
                      enabled: false
                      namespace: monitoring
                      additionalLabels:
                        release: monitoring
                
                repoServer:
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      namespace: monitoring
                      additionalLabels:
                        release: prometheus
                
                dex:
                  enabled: true
                
                controller:
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
                      namespace: monitoring
                      additionalLabels:
                        release: prometheus
                    rules:
                      enabled: true
                      additionalLabels: 
                        release: prometheus
                      namespace: monitoring
                      spec:
                      - alert: ArgoAppMissing
                        expr: |
                          absent(argocd_app_info) == 1
                        for: 15m
                        labels:
                          severity: critical
                        annotations:
                          summary: "[Argo CD] No reported applications"
                          description: >
                            Argo CD has not reported any applications data for the past 15 minutes which
                            means that it must be down or not functioning properly.  This needs to be
                            resolved for this cloud to continue to maintain state.
                      - alert: ArgoAppNotSynced
                        expr: |
                          argocd_app_info{sync_status!="Synced"} == 1
                        for: 12h
                        labels:
                          severity: warning
                        annotations:
                          summary: "[{{`{{$labels.name}}`}}] Application not synchronized"
                          description: >
                            The application [{{`{{$labels.name}}`}} has not been synchronized for over
                            12 hours which means that the state of this cloud has drifted away from the
                            state inside Git.
                
                configs:
                  params:
                    server.insecure: true
                    server.dex.server: http://argocd-dex-server:5556
                    dexserver.disable.tls: true
                    server.dex.server.strict.tls: false
                  cm:
                    url: http://argocd.thesams.site
                    dex.config:  |
                      connectors:
                      - type: github
                        id: github
                        name: GitHub
                        config:
              -           clientID: Ov23lizYwGumahePRnUi
              -           clientSecret: 813fb618f0a616277af24577ac540a37e9ab0706
              +           clientID: ""
              +           clientSecret: ""
                          orgs:
              -           - name: theSamsCo
              +           - name: desafio-acs
                
              -   repositories:
              -     infra-repo:
              -       url: https://github.com/samuelamaralls/descomplicando-gitops-no-kubernetes-argocd.git
              -       name: infra
              -       password: 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
              -       username: token
              - 
                applicationSet:
                  enabled: true
                  metrics:
                    enabled: true
                  ingress:
                    enabled: true
                    #ingressClassName: nginx
                    hostname: applicationset.thesams.site
                    path: /
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.eks_admin_users.kubernetes_config_map_v1_data.aws_auth_update will be updated in-place
  ~ resource "kubernetes_config_map_v1_data" "aws_auth_update" {
      ~ data          = {
          ~ "mapUsers" = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
                  "username": "desafio_aquarela_samuel"
              + - "groups":
              +   - "system:masters"
              +   "userarn": "arn:aws:iam::833565098889:user/desafio_aquarela_samuel"
              +   "username": "desafio_aquarela_samuel"
            EOT
        }
        id            = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks_managed_node_group.aws_eks_node_group.eks_managed_node_group will be updated in-place
  ~ resource "aws_eks_node_group" "eks_managed_node_group" {
        id                     = "desafio-aquarela-cluster:desafio-aquarela-nodegroup"
        tags                   = {
            "Name"        = "desafio-aquarela-nodegroup"
            "environment" = "dev"
            "terraform"   = "true"
        }
        # (17 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 2 -> 1
          ~ max_size     = 4 -> 3
          ~ min_size     = 2 -> 1
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Warning: Deprecated attribute

  on modules/aws-load-balancer-controller/iam.tf line 11, in resource "aws_iam_role" "eks_controller_role":
  11:                 "Federated": "arn:aws:iam::${data.aws_caller_identity.current.account_id}:oidc-provider/oidc.eks.${data.aws_region.current.name}.amazonaws.com/id/${local.oidc}"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 13 more similar warnings elsewhere)

Error: failed to create kubernetes rest client for read of resource: Get "http://localhost/api?timeout=32s": dial tcp 127.0.0.1:80: connect: connection refused

  with kubectl_manifest.app_of_apps_infra,
  on argocd.tf line 17, in resource "kubectl_manifest" "app_of_apps_infra":
  17: resource "kubectl_manifest" "app_of_apps_infra" {


```
</details>

